In [2]:
#a
import pandas as pd
import sqlite3
conn = sqlite3.connect('beachcondos.db')
cur = conn.cursor()

#import
client = pd.read_csv('Client.csv', header=0)
condo = pd.read_csv('Condo_Unit.csv', header=0)
owner = pd.read_csv('Owner.csv', header=0)

# drop the database tables the second time this runs 
cur.execute('DROP TABLE IF EXISTS Condo_Unit') 
cur.execute('DROP TABLE IF EXISTS Owner') 
cur.execute('DROP TABLE IF EXISTS Client') 

#put in database
client.to_sql('Client', con=conn, if_exists='append', index=False)
condo.to_sql('Condo_Unit', con=conn, if_exists='append', index=False)
owner.to_sql('Owner', con=conn, if_exists='append', index=False)

In [3]:
print("(1)") 
cur.execute('SELECT First_Name, Last_Name FROM Owner WHERE First_Name LIKE "%jo%"') 
df1 = pd.DataFrame(cur.fetchall(), columns=['First Name','Last Name']) 
df1

(1)

  First Name Last Name
0        Joe  Heulbert
1    Mary Jo  Gonzalez

In [4]:
print("(2)") 
cur.execute('SELECT Client_Name, State FROM Client WHERE State = "FL" or State = "NY"')
df2 = pd.DataFrame(cur.fetchall(), columns =['Client_name', 'State'])
df2

(2)

   Client_name State
0   John Alton    FL
1    Lucy Ferb    NY
2  Diana Perez    NY

In [4]:
print("(3)") 
cur.execute('SELECT Client_Name, Street, City FROM Client WHERE Client_Name LIKE "%m%" AND State = "CO" or State = "MI"')
df3 = pd.DataFrame(cur.fetchall(), columns =['Client_name', 'Street', 'City'])
df3

(3)

    Client_name       Street      City
0   Jeff Miller  134 Central  Berridge
1  Benton Smith  12 Mountain    Denton
2   George Maun     76 Dixon     Mason

In [5]:
print("(4)") 
cur.execute('SELECT Client_Name, State FROM Client WHERE State = "IA"')
df4 = pd.DataFrame(cur.fetchall(), columns =['Client_name', 'State'])
df4

(4)

     Client_name State
0  Ryan Gottberg    IA

In [6]:
print("(5)") 
cur.execute('SELECT Weekly_Rate, Bathrooms, Unit_Number FROM Condo_Unit WHERE Weekly_Rate >= 725 AND Weekly_Rate <= 1000')
df5 = pd.DataFrame(cur.fetchall(), columns=['Weekly_Rate', 'Bathrooms', 'Unit_Number'])
df5

(5)

   Weekly_Rate  Bathrooms  Unit_Number
0          725        1.0          102
1          850        2.0          207
2          975        2.5          308
3          750        1.0          403
4          800        1.0          405
5          875        1.0          511

In [11]:
print("(6)") 
cur.execute('SELECT Unit_Number, Bedrooms, Rented, Next_Available FROM Condo_Unit WHERE Bedrooms = 2 AND Rented = TRUE OR Bedrooms = 3 AND Next_Available > "2023-01-01"')
df6 = pd.DataFrame(cur.fetchall(), columns=['Unit_Number', 'Bedrooms', 'Rented', "Next_Available"])
df6

(6)

   Unit_Number  Bedrooms  Rented Next_Available
0          109         2       1     2023-10-08
1          205         2       1     2023-08-15
2          207         2       1     2023-02-06
3          501         3       0     2023-01-17
4          511         2       1     2023-03-11

In [45]:
print("(7)") 
cur.execute('SELECT First_Name, Last_Name, Street, City, State FROM Owner WHERE last_name LIKE "g%" AND State = "NY"')
df7 = pd.DataFrame(cur.fetchall(), columns=['First_Name', "Last_Name", "Street", "City", "State"])
df7

(7)

  First_Name Last_Name      Street     City State
0    Mary Jo  Gonzalez  56 Central  Nowhere    NY

In [46]:
print("(8)") 
cur.execute('SELECT Bedrooms, Weekly_Rate FROM Condo_Unit GROUP BY Bedrooms')
df8 = pd.DataFrame(cur.fetchall(), columns=['Bedrooms','AVG_Weekly_Rate'])
df8

(8)

   Bedrooms  AVG_Weekly_Rate
0         1              725
1         2             1100
2         3             1450

In [47]:
print("(9)") 
cur.execute('SELECT Client.Client_Name, Condo_Unit.Weekly_Rate, Condo_Unit.Rented, Owner.Last_Name FROM ((Client INNER JOIN Condo_Unit ON Client.Client_Number = Condo_Unit.Client_Number) INNER JOIN Owner ON Condo_Unit.Owner_Code = Owner.Owner_Code) WHERE Owner.Last_Name LIKE "A%" AND Condo_Unit.Rented = TRUE')
df9 = pd.DataFrame(cur.fetchall(), columns=['Client.Client_Name', 'Condo_Unit.Weekly_Rate', 'Condo_Unit.Rented', 'Owner.Last_Name'])
df9

(9)

,Client.Client_Name,Condo_Unit.Weekly_Rate,Condo_Unit.Rented,Owner.Last_Name
0,John Alton,1450,1,Alonso
1,West Kachi,800,1,Alonso

In [49]:
print("(10)") 
cur.execute('SELECT Client.City, Client.State, Condo_Unit.Bedrooms, Condo_Unit.Rented, Owner.State FROM ((Client INNER JOIN Condo_Unit ON Client.Client_Number = Condo_Unit.Client_Number) INNER JOIN Owner ON Condo_Unit.Owner_Code = Owner.Owner_Code) WHERE Condo_Unit.Rented = TRUE AND Condo_Unit.Bedrooms = 2 AND Owner.State = "CO"')
df10 = pd.DataFrame(cur.fetchall(), columns=['Client.City', 'Client.City', 'Condo_Unit.Bedrooms', 'Condo_Unit.Rented', 'Owner.State'])
df10

(10)

  Client.City Client.City  Condo_Unit.Bedrooms  Condo_Unit.Rented Owner.State
0    Berridge          CO                    2                  1          CO
1    Tarleton          CO                    2                  1          CO